{
  "publications": [
    {
      "title": "The LORACs prior for VAEs: Letting the Trees Speak for the Data",
      "authors": ["Sharad Vikram", "Matthew D. Hoffman", "Matthew J. Johnson"],
      "venue": "AISTATS 2019",
      "imgSrc": "/img/loracs.png",
      "description": "In variational autoencoders, the prior on the latent codes is often treated as an afterthought, but the prior shapes the kind of latent representation that the model learns. If the goal is to learn a representation that is interpretable and useful, then the prior should reflect the ways in which the high-level factors that describe the data vary. To alleviate this problem, we propose using a flexible Bayesian nonparametric hierarchical clustering prior based on the time-marginalized coalescent (TMC).",
      "arxivLink": "https://arxiv.org/abs/1810.06891"
    },
    {
      "title": "SOLAR: Deep Structured Latent Representations for Model-Based Reinforcement Learning",
      "authors": [
        "Marvin Zhang*",
        "Sharad Vikram*",
        "Laura Smith",
        "Pieter Abbeel",
        "Matthew J. Johnson",
        "Sergey Levine"
      ],
      "venue": "Preprint",
      "imgSrc": "/img/solar.png",
      "description": "Model-based reinforcement learning (RL) methods can be broadly categorized as global model methods, which depend on learning models that provide sensible predictions in a wide range of states, or local model methods, which iteratively refit simple models that are used for policy improvement. The main idea in this paper is that we can learn representations that make it easy to retrospectively infer simple dynamics given the data from the current policy, thus enabling local models to be used for policy learning in complex systems. We compare our method to other model-based and model-free RL methods on a suite of robotics tasks, including manipulation tasks on a real Sawyer robotic arm directly from camera images.",
      "arxivLink": "https://arxiv.org/abs/1808.09105",
      "projectLink": "https://sites.google.com/view/icml19solar"
    },
    {
      "title": "Interactive Bayesian Hierarchical Clustering",
      "authors": ["Sharad Vikram", "Sanjoy Dasgupta"],
      "venue": "ICML 2016",
      "imgSrc": "/img/ibhc.png",
      "description": "Clustering is a powerful tool in data analysis, but it is often difficult to find a grouping that aligns with a user's needs. To address this, several methods incorporate constraints obtained from users into clustering algorithms, but unfortunately do not apply to hierarchical clustering. We design an interactive Bayesian algorithm that incorporates user interaction into hierarchical clustering while still utilizing the geometry of the data by sampling a constrained posterior distribution over hierarchies.",
      "arxivLink": "https://arxiv.org/abs/1602.03258"
    }
  ]
}
